{
  "formTitle": "Business Health Checklist - Business Strategy",
  "formDescription": "This section explores your business's strategy, goals and areas for growth. Assess your current business planning, strategy and what makes your business stand out.",
  "categories": [
    {
      "id": "business_strategy",
      "label": "Business Strategy",
      "description": "Explore your businesses plans, vision and objective and competitive positioning."
    }
  ],
  "pages": [
    {
      "id": "page_strategy",
      "title": "Business Strategy Questions",
      "description": "Assess your current business planning, strategy and what makes your business stand out.",
      "fields": [
        {
          "id": "strategy_q1",
          "type": "radio",
          "label": "Have you written down the goals you want to achieve through owning your own business?",
          "description": "",
          "category": "business_strategy",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strength",
                "text": "Clear goals help guide your strategy and decision making in business"
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Being clear about why you are in business and what you are working to achieve will help you focus on what is important. It can be the basis of your decisions. Having clear goals can motivate your staff and get everyone working towards the same thing."
              }
            }
          ]
        },
        {
          "id": "strategy_q2",
          "type": "radio",
          "label": "Do you have a written business strategy that outlines how you are going to work towards your business goals?",
          "description": "A clear strategy helps you stay focused and make informed decisions as your business evolves.",
          "category": "business_strategy",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strength",
                "text": "You’ve got a clear plan that helps guide your business decisions and priorities."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Take time to write down a clear path to achieving your business goals. It does not have to be complicated. What do you do every day, week, month or year to move towards what you are trying to achieve. A simple strategy can help you stay on track, make better decisions, and grow with confidence. You can also create a one-page business strategic plan. It is good practice to review this every year. There are resources online. You can access funding through Business Growth Program to engage a business advisor to help you develop this."
              }
            }
          ]
        },
        {
          "id": "strategy_q3",
          "type": "radio",
          "label": "Do you regularly review and update your business goals and strategy (at least annually)?",
          "description": "Markets change, and so do customer needs, so it’s important to review your goals regularly. Updating your goals helps make sure they still make sense and keep your business heading in the right direction.",
          "category": "business_strategy",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strength",
                "text": "You regularly review your goals to keep your business focused and flexible."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Set a time each year to check in on your goals. You can do this by yourself, with your leadership team or with an external specialist. Making small updates can help you stay on track and respond to changes in your industry or community."
              }
            }
          ]
        },
        {
          "id": "strategy_q4",
          "type": "radio",
          "label": "Have you clearly worked out what makes your business stand out from the crowd? (your value proposition)",
          "description": "Knowing what makes your business unique, your value proposition, helps you attract the right customers and stand out from competitors. It could be your service, your location, your story, your products, or the experience you offer. When you are clear on what sets you apart, it’s easier to promote your business and grow.",
          "category": "business_strategy",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strength",
                "text": "You know what makes your business special and use it to connect with your customers."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Take time to define what makes your business different. This helps you focus your business strategy. You can market to and attract loyal customers and stand out in a busy market. Access tools and resources for marketing and customer engagement"
              }
            }
          ]
        },
        {
          "id": "strategy_q5",
          "type": "radio",
          "label": "Do you keep an eye on changes in your industry, market trends, or what your customers want?",
          "description": "Things change like new trends, customer needs, and even competitors. By staying informed, you can adjust your strategy, stay ahead of the game, and keep your business competitive.",
          "category": "business_strategy",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strength",
                "text": "You stay up to date with what is happening in your industry and use that knowledge to guide your business."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Make time to check in on market trends and customer feedback. Even small insights can help you make better decisions and spot new opportunities. Learn about doing market research"
              }
            }
          ]
        },
        {
          "id": "strategy_q6",
          "type": "radio",
          "label": "Is your business strategy set up to support long-term success financially, environmentally, and with your team?",
          "description": "A sustainable strategy helps your business stay strong over time. This means thinking about: Making enough profit to stay viable, Reducing your impact on the environment, Supporting and keeping good staff, Planning for long-term sustainability helps your business stay resilient and ready for the future.",
          "category": "business_strategy",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strength",
                "text": "You have built a strategy that supports long-term success for your business, your team, and the environment."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Think about how your business can be more sustainable financially, environmentally, and socially. Even small changes can help your business stay strong and make a positive impact. Consider applying for funding through Business Growth Program to work with a specialist service provider to make a sustainable business strategy with you."
              }
            }
          ]
        },
        {
          "id": "strategy_q7",
          "type": "radio",
          "label": "Have you thought about offering new products, services, or reaching new customers to reduce risk?",
          "description": "Diversifying your business can help protect you from changes in the market or customer demand. You might: Add new services or experiences, Team up with other businesses, Try new suppliers, Explore new customer groups or markets, It is a smart way to spread your risk and keep your business strong.",
          "category": "business_strategy",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strength",
                "text": "You are actively looking for ways to grow and protect your business by diversifying."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Usure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Think about how you could expand what you offer or who you serve. Diversifying helps you stay flexible and better prepared for changes in the market. Learn about growing your business in the NT,"
              }
            }
          ]
        },
        {
          "id": "strategy_q8",
          "type": "radio",
          "label": "Have you thought about partnerships, collaborations or teaming up with other businesses to strengthen your strategy?",
          "description": "Working with others can open up new opportunities, reduce costs, and help you grow. You might: Share resources, Create joint offers or packages, Reach new customers, Build new skills or capabilities, Strategic partnerships can make your business stronger and more flexible.",
          "category": "business_strategy",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strength",
                "text": "You are open to working with others to grow your business and explore new opportunities."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Usure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Look for businesses you could collaborate with whether it is sharing ideas, creating joint offers, or reaching new markets together. Partnerships can help you do more with less and build long-term success. Learn about how collaboration can help your business, If you are an Aboriginal Business, consider linking in with NT Indigenous Business Network (NTIBN) as part of your collaboration strategy. if you are a business looking for new procurement opportunities, explore the Industry Capability Network (ICN)"
              }
            }
          ]
        },
        {
          "id": "strategy_q9",
          "type": "radio",
          "label": "Do you use data or key numbers to track how your business is going and if you are meeting your goals?",
          "description": "Tracking your progress helps you see what is working and what needs attention. You might look at things like: Sales numbers, Customer feedback, Website traffic, Profit margins, Staff performance, Using this info helps you make better decisions and stay on track with your goals.",
          "category": "business_strategy",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strength",
                "text": "You use data and key numbers to measure progress and guide your business decisions."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Usure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Start tracking a few key numbers that matter most to your business. It does not have to be complicated, just knowing what to watch can help you grow and improve. Learn how data can improve your business"
              }
            }
          ]
        },
        {
          "id": "strategy_q10",
          "type": "radio",
          "label": "Do you ask your staff, customers, or advisors for feedback to help improve your business?",
          "description": "Getting feedback gives you fresh ideas and helps you see things you might miss. It can help you: Improve your products or services, Make better decisions, Strengthen your strategy, Build stronger relationships with your team and customers, Listening to others can help your business grow in the right direction.",
          "category": "business_strategy",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strength",
                "text": "You actively seek feedback and use it to improve your business."
              }
            },
            {
              "value": "no_unsure",
              "label": "No/Unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Make it easy for people to share their thoughts. You could implement this through chats, surveys, or regular check-ins. Feedback is a powerful tool to help you make smart changes and stay connected to your customers and team. Read about engaging with customers, including asking for feedback"
              }
            }
          ]
        }
      ]
    }
  ]
}