{
  "formTitle": "Business Health Checklist - Business Operations",
  "formDescription": "Explore your daily operations including resourcing requirements and business relationships with suppliers, partners and employees. Review your current situation and discover any gaps in your knowledge.",
  "categories": [
    {
      "id": "business_operations",
      "label": "Business Operations",
      "description": "Explore your daily operations including resourcing requirements and business relationships."
    }
  ],
  "pages": [
    {
      "id": "page_operations",
      "title": "Business Operations Questions",
      "description": "Review your current situation and discover any gaps in your knowledge.",
      "fields": [
        {
          "id": "operations_q1",
          "type": "radio",
          "label": "Do you have a current business plan?",
          "description": "A business plan helps guide your operations, growth, and decision-making. It should be reviewed and updated at least once a year.",
          "category": "business_operations",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "Your business plan is current and regularly refreshed to stay aligned with your goals."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Ensure you have a business plan, and you keep it fresh. A current business plan helps you stay focused on your goals and vision. It also gives you more control over your direction and helps you respond confidently to new opportunities or challenges. Find out how to write a business plan. Explore the Business Growth Program for funding and advisory support."
              }
            }
          ]
        },
        {
          "id": "operations_q2",
          "type": "radio",
          "label": "Does your current business structure support your goals?",
          "description": "Your business structure can influence your tax, liability, costs, and control. Common structures include sole trader, company, partnership, and trust.",
          "category": "business_operations",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "Your current business structure supports your goals and future growth"
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "As your business evolves, your structure may need to change. The right setup gives you flexibility, control, and protection. Be aware of how each option works and consider what might be right for you. Talking to an accountant may be helpful for you to figure out the right set up for you. Learn more about business structures with this information from ASIC. You can also find information from the ATO on business structures and the tax obligations associated."
              }
            }
          ]
        },
        {
          "id": "operations_q3",
          "type": "radio",
          "label": "Do you know the key systems and processes you need to run your business each day?",
          "description": "These may include financial management, HR, marketing, risk management, operations, supply chain, and sustainability.",
          "category": "business_operations",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "Your key systems and processes are clear, well-understood, and working for your business"
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Strengthen your systems and processes. Review your day-to-day operations like marketing, HR, and risk management, to make sure they are supporting your business effectively. Strong systems help your business run smoothly and prepare you for growth or unexpected challenges. Find business operations templates, Find financial management templates, Find marketing and customer engagement templates, Explore other topics around Help for your Business"
              }
            }
          ]
        },
        {
          "id": "operations_q4",
          "type": "radio",
          "label": "Do you have the right policies and procedures in place to ensure a safe and consistent workplace?",
          "description": "These may include policies for: Workplace health and safety, Privacy and data protection, Employment and HR practices, Customer service standards",
          "category": "business_operations",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "Your policies and procedures support the running of your business. Your staff and management team know where to find these documents and how to use them."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Clear policies help create a safe, fair, and consistent workplace. They protect your business, support staff wellbeing, and ensure compliance with legal obligations. Review your policies regularly and make sure your team is trained to follow them. You can request a visit from an NT WorkSafe inspector to help identify and improve your workplace health and safety systems. You can apply for funding through the Business Growth Program to engage consultants who will support the development of systems and practices for maintaining a safe workplace."
              }
            }
          ]
        },
        {
          "id": "operations_q5",
          "type": "radio",
          "label": "Are your business premises suitable and in the right location for your needs now and in the future?",
          "description": "Your premises should support your current operations and allow for future growth. This could include: Warehouse, manufacturing or storage space, Shared or independent office space, Retail or shopfront space, A home office",
          "category": "business_operations",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "Your current premises support your business needs now and into the future."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Opportunity to Improve:"
              }
            }
          ]
        }
      ]
    }
  ]
}