{
  "formTitle": "Business Health Checklist - Customers and Marketing",
  "formDescription": "This section explores your business's target markets and how to attract and retain customers. Find out how you currently engage with your customers and where you can improve. Did you know that you can engage a service provider through the Business Growth Program to develop a comprehensive Marketing plan for you, including foals, identifying key customers and your unique selling points.",
  "categories": [
    {
      "id": "customers_marketing",
      "label": "Understand your customers and marketing",
      "description": "Explore your businesses target markets, your relationships with customers and marketing strategies."
    }
  ],
  "pages": [
    {
      "id": "page_marketing",
      "title": "Customers and Marketing Questions",
      "description": "Find out how you currently engage with your customers and where you can improve.",
      "fields": [
        {
          "id": "marketing_q1",
          "type": "radio",
          "label": "Do you clearly understand who your main customers are?",
          "description": "Knowing your key customer groups helps you offer the right products, services, and messages.",
          "category": "customers_marketing",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "You know who your customers are and how to meet their needs"
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Take time to research your customer groups. When you understand who your customers are, you can make better decisions about your products, services, and marketing. It also helps you plan for growth and reach new markets. Use data from your sales. If you are looking for help, you can engage a service provider through the Business Growth Program to assist. Learn more about identifying your target market"
              }
            }
          ]
        },
        {
          "id": "marketing_q2",
          "type": "radio",
          "label": "Do you know your customers’ characteristics, like their age, location, and interests?",
          "description": "This helps you tailor your offerings and marketing more effectively.",
          "category": "customers_marketing",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "You know what your customers want and need."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Knowing your customers’ needs helps you deliver better products and services. Satisfied customers are more likely to return and recommend your business. Some examples of how to get to know your customers: Ask them questions directly through surveys or polling. Analyse customer data from your own sales records or social media. It can also help you make decisions about how, where and how much to spend on marketing efforts. E.g. Are your customers actively using Facebook or Instagram more? Are they more likely to google you or contact you after being recommended by a friend."
              }
            }
          ]
        },
        {
          "id": "marketing_q3",
          "type": "radio",
          "label": "Do you understand what your customers need, want, and expect from your business?",
          "description": "Meeting customer expectations builds trust and loyalty.",
          "category": "customers_marketing",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "You have a clear approach to managing customer service and relationships,"
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "A planned approach to customer service helps build strong relationships and support, especially during tough times. Ask for feedback through reviews or surveys to understand how you are doing. Learn about managing customer relationships, Learn about handling customer complaints"
              }
            }
          ]
        },
        {
          "id": "marketing_q4",
          "type": "radio",
          "label": "Do you actively seek and record customer feedback, complaints, or suggestions?",
          "description": "Feedback helps you improve and respond to customer needs.",
          "category": "customers_marketing",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "You are building a strong reputation and loyal customer base."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "A good reputation and loyal customers help your business grow. You can work on this by using feedback to improve your services and build trust. Learn about how to communicate with customers"
              }
            }
          ]
        },
        {
          "id": "marketing_q5",
          "type": "radio",
          "label": "Do you have loyal customers who return and refer others to your business?",
          "description": "Customer loyalty is a sign of strong relationships and a positive reputation.",
          "category": "customers_marketing",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "You know what makes your business stand out,"
              }
            },
            {
              "value": "no_unsure",
              "label": "No and unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "It is important to know what makes your business different from other businesses. Find out what your customers like about your business and use that in your marketing. Knowing what makes you different helps build loyalty, Learn about developing a marketing plan,"
              }
            }
          ]
        },
        {
          "id": "marketing_q6",
          "type": "radio",
          "label": "Do you know why customers choose your business over others?",
          "description": "Understanding your competitive edge helps you stay ahead.",
          "category": "customers_marketing",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes_na",
              "label": "Yes / Not Applicable",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "You know your target markets and what they value,"
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "‘Everyone’ is not a target market. Focus on specific customer groups and tailor your marketing to them. Read about how you can keep your customers coming back."
              }
            }
          ]
        },
        {
          "id": "marketing_q7",
          "type": "radio",
          "label": "Do you target more than one customer group?",
          "description": "Diversifying your customer base can reduce risk and open new growth opportunities",
          "category": "customers_marketing",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes_na",
              "label": "Yes / Not Applicable",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "You use the right marketing channels for different customer groups."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Relying on one customer group can be risky. Explore new markets to grow your business. Your new customers might be interstate, overseas, in a different area or a different age group. Get creative in how you think of your customers."
              }
            }
          ]
        },
        {
          "id": "marketing_q8",
          "type": "radio",
          "label": "Is your marketing effective in reaching and engaging your target customer groups?",
          "description": "Effective marketing helps attract and keep the right customers.",
          "category": "customers_marketing",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes_na",
              "label": "Yes / Not Applicable",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "Your marketing is working to help market your business to the right customers and stay in touch with your customers."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Unsure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Consider the different marketing channels you can use. Being online can help attract new customers to your business. It can also increase how many customers you can reach, improve your customer communication and build customer loyalty. Before you start using any of these online channels, review the different options and see which is the best fit for your business. Learn more about advertising your business, Learn about digital tools for marketing your business, Engage a service provider through the Business Growth Program to develop a comprehensive marketing plan for your business"
              }
            }
          ]
        },
        {
          "id": "marketing_q9",
          "type": "radio",
          "label": "Do you have an active and regularly updated digital presence (e.g. website, social media)?",
          "description": "A strong online presence keeps customers informed and connected to your business.",
          "category": "customers_marketing",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your Strengths",
                "text": "You keep your customers informed and engaged through your online platforms. Your digital presence provides opportunities to attract new customers and maintain strong relationships with existing ones."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Usure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Keeping your website and social media up to date helps customers find accurate information about your business, builds trust, and shows that you're active and engaged. A strong online presence also makes it easier for new customers to discover your business, especially in remote or regional areas of the NT where digital visibility is key. Find information about online and digital strategies and tools that your business can use."
              }
            }
          ]
        },
        {
          "id": "marketing_q10",
          "type": "radio",
          "label": "Do you use customer insights to improve your products, services, or marketing?",
          "description": "Using data and feedback helps you make informed decisions and stay customer focused.",
          "category": "customers_marketing",
          "required": false,
          "points": 0,
          "options": [
            {
              "value": "yes",
              "label": "Yes",
              "points": 0,
              "feedback": {
                "title": "Your strength",
                "text": "You make informed decisions based on what your customers tell you. Using feedback and data shows you’re committed to continuous improvement and staying customer focused."
              }
            },
            {
              "value": "no_unsure",
              "label": "No and Usure",
              "points": 0,
              "feedback": {
                "title": "Opportunity to Improve",
                "text": "Listening to your customers, through feedback, reviews, or data, helps you make smarter decisions and stay competitive. By using what you learn, you can improve your offerings, respond to changing needs, and build stronger relationships with your customers."
              }
            }
          ]
        }
      ]
    }
  ]
}